// ฟังกชันคำณวนเกรด

//  การสร้างฟังก์ชัน ชื่อ calculateGrade ให้พารามิเตอร์ score เก็บตัวเลข และส่งผลลัพธ์กลับออกมาเป็นข้อความ (เกรด)
function calculateGrade(score: number): string {
    if (score > 100 || score < 0) { // if ถ้าตัวเลขใน score มากกว่า 100 หรือน้อยกว่า 100 ให้แสดงผลลัพธ์เป็นข้อความว่า...
        return "คะแนนไม่ถูกต้อง! กรุณากรอกใหม่";
    } else if (score >= 80) { //แต่ถ้าไม่ใช่เงื่อนไขแรก แต่ตัวเลขใน score มีค่ามากกว่าหรือเท่ากับ 80 ให้ส่งผลลัพธ์ออกมาเป็น...
        return "A";
    } else if (score >= 75) {
        return "B+";
    } else if (score >= 70) {
        return "B";
    } else if (score >= 65) {
        return "C+";
    } else if (score >= 60) {
        return "C";
    } else if (score >= 50) {
        return "D";
    } else { //ถ้าไม่เข้าเงื่อนไขไหนเลยให้แสดงผลเป็น f
        return "F";
    }
}

// แสดงข้อความทักทายและรับค่าจากผู้ใช้ (ค่าที่ได้กลับมาจะเป็นตัวหนังสือ หรือ string)
const input = prompt("กรุณากรอกคะแนนของคุณ : ");

//แปลงข้อความผู้ใช้พิมพ์ให้กลายเป็น "ตัวเลข (number)" 
// ถ้าผู้ใช้ไม่ได้พิมพ์อะไรเลย ให้เปลี่ยนเป็นเลข 0 แทน
const score = Number(input);

//เอาคะแนนที่แปลงแล้ว ส่งเข้าไปคำณวนในฟังก์ชัน
const grade = calculateGrade(score);

//แสดงผลลัพธ์ออกทางหน้าจอ
console.log(`--------------------`)
console.log(`คะแนนที่กรอกคือ:${score}`);
console.log(`เกรดของคุณคือ: ${grade}`);
console.log(`--------------------`)